perfTest/stage3/get_async.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  601.58us  15.98ms   81.53%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.10ms
 75.000%    1.45ms
 90.000%    1.72ms
 99.000%    2.21ms
 99.900%    2.50ms
 99.990%   15.91ms
 99.999%   15.99ms
100.000%   15.99ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.087     0.000000            1         1.00
       0.535     0.100000          982         1.11
       0.665     0.200000         1962         1.25
       0.796     0.300000         2934         1.43
       0.950     0.400000         3913         1.67
       1.101     0.500000         4897         2.00
       1.179     0.550000         5388         2.22
       1.245     0.600000         5869         2.50
       1.311     0.650000         6356         2.86
       1.372     0.700000         6848         3.33
       1.447     0.750000         7336         4.00
       1.480     0.775000         7583         4.44
       1.517     0.800000         7824         5.00
       1.557     0.825000         8070         5.71
       1.602     0.850000         8317         6.67
       1.651     0.875000         8558         8.00
       1.680     0.887500         8678         8.89
       1.715     0.900000         8805        10.00
       1.748     0.912500         8923        11.43
       1.786     0.925000         9045        13.33
       1.829     0.937500         9170        16.00
       1.851     0.943750         9229        17.78
       1.881     0.950000         9291        20.00
       1.916     0.956250         9352        22.86
       1.950     0.962500         9413        26.67
       1.980     0.968750         9475        32.00
       2.003     0.971875         9504        35.56
       2.034     0.975000         9535        40.00
       2.057     0.978125         9566        45.71
       2.095     0.981250         9595        53.33
       2.127     0.984375         9627        64.00
       2.141     0.985938         9643        71.11
       2.159     0.987500         9661        80.00
       2.189     0.989062         9672        91.43
       2.231     0.990625         9688       106.67
       2.245     0.992188         9703       128.00
       2.255     0.992969         9710       142.22
       2.273     0.993750         9717       160.00
       2.287     0.994531         9725       182.86
       2.295     0.995313         9733       213.33
       2.327     0.996094         9741       256.00
       2.331     0.996484         9744       284.44
       2.345     0.996875         9748       320.00
       2.369     0.997266         9752       365.71
       2.399     0.997656         9756       426.67
       2.411     0.998047         9759       512.00
       2.441     0.998242         9761       568.89
       2.449     0.998437         9763       640.00
       2.457     0.998633         9765       731.43
       2.477     0.998828         9767       853.33
       2.527     0.999023         9769      1024.00
       3.067     0.999121         9770      1137.78
      11.991     0.999219         9771      1280.00
      12.671     0.999316         9772      1462.86
      15.647     0.999414         9773      1706.67
      15.679     0.999512         9774      2048.00
      15.679     0.999561         9774      2275.56
      15.783     0.999609         9775      2560.00
      15.783     0.999658         9775      2925.71
      15.855     0.999707         9776      3413.33
      15.855     0.999756         9776      4096.00
      15.855     0.999780         9776      4551.11
      15.911     0.999805         9777      5120.00
      15.911     0.999829         9777      5851.43
      15.911     0.999854         9777      6826.67
      15.911     0.999878         9777      8192.00
      15.911     0.999890         9777      9102.22
      15.991     0.999902         9778     10240.00
      15.991     1.000000         9778          inf
#[Mean    =        1.123, StdDeviation   =        0.602]
#[Max     =       15.984, Total count    =         9778]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9782 requests in 10.00s, 792.88KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
  Non-2xx or 3xx responses: 9782
Requests/sec:    977.90
Transfer/sec:     79.26KB