perfTest/stage3/get_sync.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.41ms    9.08ms 206.21ms   84.72%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.36ms
 75.000%    2.16ms
 90.000%   21.66ms
 99.000%   35.10ms
 99.900%   40.38ms
 99.990%   43.26ms
 99.999%  206.34ms
100.000%  206.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.088     0.000000            1         1.00
       0.577     0.100000          964         1.11
       0.781     0.200000         1927         1.25
       0.991     0.300000         2888         1.43
       1.174     0.400000         3848         1.67
       1.355     0.500000         4810         2.00
       1.442     0.550000         5293         2.22
       1.539     0.600000         5776         2.50
       1.672     0.650000         6255         2.86
       1.838     0.700000         6734         3.33
       2.163     0.750000         7216         4.00
       3.275     0.775000         7456         4.44
       9.439     0.800000         7696         5.00
      12.663     0.825000         7939         5.71
      14.783     0.850000         8177         6.67
      18.511     0.875000         8418         8.00
      20.431     0.887500         8538         8.89
      21.695     0.900000         8658        10.00
      22.879     0.912500         8778        11.43
      24.175     0.925000         8898        13.33
      25.663     0.937500         9020        16.00
      26.367     0.943750         9079        17.78
      26.911     0.950000         9139        20.00
      27.615     0.956250         9200        22.86
      28.383     0.962500         9260        26.67
      29.311     0.968750         9321        32.00
      29.871     0.971875         9349        35.56
      30.447     0.975000         9379        40.00
      30.863     0.978125         9410        45.71
      31.519     0.981250         9439        53.33
      32.303     0.984375         9469        64.00
      32.767     0.985938         9484        71.11
      33.375     0.987500         9499        80.00
      34.303     0.989062         9514        91.43
      35.519     0.990625         9529       106.67
      36.959     0.992188         9545       128.00
      37.695     0.992969         9552       142.22
      37.951     0.993750         9559       160.00
      38.143     0.994531         9568       182.86
      38.463     0.995313         9574       213.33
      38.879     0.996094         9582       256.00
      39.327     0.996484         9586       284.44
      39.423     0.996875         9589       320.00
      39.551     0.997266         9594       365.71
      39.647     0.997656         9597       426.67
      39.871     0.998047         9601       512.00
      39.935     0.998242         9604       568.89
      39.935     0.998437         9604       640.00
      40.063     0.998633         9606       731.43
      40.159     0.998828         9608       853.33
      40.479     0.999023         9610      1024.00
      40.959     0.999121         9611      1137.78
      42.079     0.999219         9612      1280.00
      42.495     0.999316         9613      1462.86
      42.815     0.999414         9614      1706.67
      42.847     0.999512         9615      2048.00
      42.847     0.999561         9615      2275.56
      43.103     0.999609         9617      2560.00
      43.103     0.999658         9617      2925.71
      43.103     0.999707         9617      3413.33
      43.103     0.999756         9617      4096.00
      43.103     0.999780         9617      4551.11
      43.263     0.999805         9618      5120.00
      43.263     0.999829         9618      5851.43
      43.263     0.999854         9618      6826.67
      43.263     0.999878         9618      8192.00
      43.263     0.999890         9618      9102.22
     206.335     0.999902         9619     10240.00
     206.335     1.000000         9619          inf
#[Mean    =        5.412, StdDeviation   =        9.075]
#[Max     =      206.208, Total count    =         9619]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9628 requests in 10.22s, 616.22KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    941.71
Transfer/sec:     60.27KB