perfTest/stage3/put_async.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.53ms    1.02ms  28.70ms   92.43%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.42ms
 75.000%    1.82ms
 90.000%    2.27ms
 99.000%    4.66ms
 99.900%   14.26ms
 99.990%   25.93ms
 99.999%   28.72ms
100.000%   28.72ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.149     0.000000            1         1.00
       0.733     0.100000          978         1.11
       0.924     0.200000         1959         1.25
       1.099     0.300000         2937         1.43
       1.263     0.400000         3916         1.67
       1.417     0.500000         4892         2.00
       1.487     0.550000         5391         2.22
       1.557     0.600000         5872         2.50
       1.632     0.650000         6357         2.86
       1.717     0.700000         6846         3.33
       1.818     0.750000         7338         4.00
       1.871     0.775000         7582         4.44
       1.930     0.800000         7827         5.00
       1.990     0.825000         8071         5.71
       2.067     0.850000         8315         6.67
       2.161     0.875000         8561         8.00
       2.215     0.887500         8680         8.89
       2.269     0.900000         8802        10.00
       2.341     0.912500         8925        11.43
       2.425     0.925000         9046        13.33
       2.519     0.937500         9168        16.00
       2.573     0.943750         9231        17.78
       2.637     0.950000         9292        20.00
       2.723     0.956250         9355        22.86
       2.827     0.962500         9413        26.67
       2.949     0.968750         9474        32.00
       3.043     0.971875         9504        35.56
       3.149     0.975000         9535        40.00
       3.307     0.978125         9566        45.71
       3.617     0.981250         9596        53.33
       3.883     0.984375         9627        64.00
       4.013     0.985938         9642        71.11
       4.215     0.987500         9657        80.00
       4.563     0.989062         9673        91.43
       4.771     0.990625         9688       106.67
       5.091     0.992188         9703       128.00
       5.199     0.992969         9711       142.22
       5.603     0.993750         9718       160.00
       5.783     0.994531         9726       182.86
       6.291     0.995313         9734       213.33
       6.599     0.996094         9741       256.00
       6.983     0.996484         9745       284.44
       7.551     0.996875         9749       320.00
       7.891     0.997266         9753       365.71
       9.287     0.997656         9757       426.67
      10.207     0.998047         9760       512.00
      11.655     0.998242         9762       568.89
      12.031     0.998437         9764       640.00
      12.327     0.998633         9766       731.43
      13.335     0.998828         9768       853.33
      15.143     0.999023         9770      1024.00
      15.423     0.999121         9771      1137.78
      15.743     0.999219         9772      1280.00
      16.079     0.999316         9773      1462.86
      18.959     0.999414         9774      1706.67
      19.727     0.999512         9775      2048.00
      19.727     0.999561         9775      2275.56
      20.095     0.999609         9776      2560.00
      20.095     0.999658         9776      2925.71
      24.911     0.999707         9777      3413.33
      24.911     0.999756         9777      4096.00
      24.911     0.999780         9777      4551.11
      25.935     0.999805         9778      5120.00
      25.935     0.999829         9778      5851.43
      25.935     0.999854         9778      6826.67
      25.935     0.999878         9778      8192.00
      25.935     0.999890         9778      9102.22
      28.719     0.999902         9779     10240.00
      28.719     1.000000         9779          inf
#[Mean    =        1.527, StdDeviation   =        1.022]
#[Max     =       28.704, Total count    =         9779]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9783 requests in 10.00s, 640.10KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    977.93
Transfer/sec:     63.99KB